### dummies

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

### stack and unstack

In [3]:
data = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1    0.724559
   2    0.077294
   3    1.146936
b  1   -1.249292
   3    1.260152
c  1   -0.140166
   2   -0.596728
d  2    0.254509
   3   -1.239596
dtype: float64

In [5]:
data.unstack()

          1         2         3
a  0.724559  0.077294  1.146936
b -1.249292       NaN  1.260152
c -0.140166 -0.596728       NaN
d       NaN  0.254509 -1.239596

In [7]:
data.unstack().stack()

a  1    0.724559
   2    0.077294
   3    1.146936
b  1   -1.249292
   3    1.260152
c  1   -0.140166
   2   -0.596728
d  2    0.254509
   3   -1.239596
dtype: float64

### grouped

In [11]:
tips = pd.read_csv('tips.csv')

In [12]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [13]:
grouped = tips.groupby(['day', 'smoker'])

grouped_pct = grouped['tip_pct']

grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [14]:
def peak_to_peak(arr):
     return arr.max() - arr.min()

In [15]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

### combine

In [16]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [17]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [18]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [19]:
 pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

### random sample

In [20]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [21]:
sampler = np.random.permutation(5)
sampler

array([3, 2, 1, 0, 4])

In [23]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

### crosstab

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame=pd.DataFrame(data)

In [26]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [27]:
pd.crosstab(frame.state,frame.year)

year    2000  2001  2002  2003
state
Nevada     0     1     1     1
Ohio       1     1     1     0